docs/evidence/04-circuit-breaker/problem/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/scripts/phase4-slow-product.js
        output: Prometheus remote write (http://34.64.219.137:30090/api/v1/write)

     scenarios: (100.00%) 2 scenarios, 35 max VUs, 1m0s max duration (incl. graceful stop):
              * order_creation: 30 looping VUs for 30s (exec: createOrder, gracefulStop: 30s)
              * order_query: 5 looping VUs for 30s (exec: queryOrders, gracefulStop: 30s)


running (0m01.0s), 35/35 VUs, 5 complete and 0 interrupted iterations
order_creation   [   3% ] 30 VUs  01.0s/30s
order_query      [   3% ] 5 VUs   01.0s/30s

running (0m02.0s), 35/35 VUs, 15 complete and 0 interrupted iterations
order_creation   [   7% ] 30 VUs  02.0s/30s
order_query      [   7% ] 5 VUs   02.0s/30s

running (0m03.0s), 35/35 VUs, 25 complete and 0 interrupted iterations
order_creation   [  10% ] 30 VUs  03.0s/30s
order_query      [  10% ] 5 VUs   03.0s/30s

running (0m04.0s), 35/35 VUs, 35 complete and 0 interrupted iterations
order_creation   [  13% ] 30 VUs  04.0s/30s
order_query      [  13% ] 5 VUs   04.0s/30s

running (0m05.0s), 35/35 VUs, 45 complete and 0 interrupted iterations
order_creation   [  17% ] 30 VUs  05.0s/30s
order_query      [  17% ] 5 VUs   05.0s/30s

running (0m06.0s), 35/35 VUs, 55 complete and 0 interrupted iterations
order_creation   [  20% ] 30 VUs  06.0s/30s
order_query      [  20% ] 5 VUs   06.0s/30s

running (0m07.0s), 35/35 VUs, 65 complete and 0 interrupted iterations
order_creation   [  23% ] 30 VUs  07.0s/30s
order_query      [  23% ] 5 VUs   07.0s/30s

running (0m08.0s), 35/35 VUs, 75 complete and 0 interrupted iterations
order_creation   [  27% ] 30 VUs  08.0s/30s
order_query      [  27% ] 5 VUs   08.0s/30s

running (0m09.0s), 35/35 VUs, 85 complete and 0 interrupted iterations
order_creation   [  30% ] 30 VUs  09.0s/30s
order_query      [  30% ] 5 VUs   09.0s/30s

running (0m10.0s), 35/35 VUs, 95 complete and 0 interrupted iterations
order_creation   [  33% ] 30 VUs  10.0s/30s
order_query      [  33% ] 5 VUs   10.0s/30s

running (0m11.0s), 35/35 VUs, 105 complete and 0 interrupted iterations
order_creation   [  37% ] 30 VUs  11.0s/30s
order_query      [  37% ] 5 VUs   11.0s/30s

running (0m12.0s), 35/35 VUs, 115 complete and 0 interrupted iterations
order_creation   [  40% ] 30 VUs  12.0s/30s
order_query      [  40% ] 5 VUs   12.0s/30s

running (0m13.0s), 35/35 VUs, 125 complete and 0 interrupted iterations
order_creation   [  43% ] 30 VUs  13.0s/30s
order_query      [  43% ] 5 VUs   13.0s/30s

running (0m14.0s), 35/35 VUs, 130 complete and 0 interrupted iterations
order_creation   [  47% ] 30 VUs  14.0s/30s
order_query      [  47% ] 5 VUs   14.0s/30s

running (0m15.0s), 35/35 VUs, 149 complete and 0 interrupted iterations
order_creation   [  50% ] 30 VUs  15.0s/30s
order_query      [  50% ] 5 VUs   15.0s/30s
time="2026-04-27T08:51:55+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T08:51:55+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T08:51:55+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
[...]

running (0m16.0s), 35/35 VUs, 180 complete and 0 interrupted iterations
order_creation   [  53% ] 30 VUs  16.0s/30s
order_query      [  53% ] 5 VUs   16.0s/30s

running (0m17.0s), 35/35 VUs, 190 complete and 0 interrupted iterations
order_creation   [  57% ] 30 VUs  17.0s/30s
order_query      [  57% ] 5 VUs   17.0s/30s

running (0m18.0s), 35/35 VUs, 200 complete and 0 interrupted iterations
order_creation   [  60% ] 30 VUs  18.0s/30s
order_query      [  60% ] 5 VUs   18.0s/30s

running (0m19.0s), 35/35 VUs, 210 complete and 0 interrupted iterations
order_creation   [  63% ] 30 VUs  19.0s/30s
order_query      [  63% ] 5 VUs   19.0s/30s

running (0m20.0s), 35/35 VUs, 220 complete and 0 interrupted iterations
order_creation   [  67% ] 30 VUs  20.0s/30s
order_query      [  67% ] 5 VUs   20.0s/30s

running (0m21.0s), 35/35 VUs, 230 complete and 0 interrupted iterations
order_creation   [  70% ] 30 VUs  21.0s/30s
order_query      [  70% ] 5 VUs   21.0s/30s

running (0m22.0s), 35/35 VUs, 240 complete and 0 interrupted iterations
order_creation   [  73% ] 30 VUs  22.0s/30s
order_query      [  73% ] 5 VUs   22.0s/30s

running (0m23.0s), 35/35 VUs, 250 complete and 0 interrupted iterations
order_creation   [  77% ] 30 VUs  23.0s/30s
order_query      [  77% ] 5 VUs   23.0s/30s

running (0m24.0s), 35/35 VUs, 260 complete and 0 interrupted iterations
order_creation   [  80% ] 30 VUs  24.0s/30s
order_query      [  80% ] 5 VUs   24.0s/30s

running (0m25.0s), 35/35 VUs, 270 complete and 0 interrupted iterations
order_creation   [  83% ] 30 VUs  25.0s/30s
order_query      [  83% ] 5 VUs   25.0s/30s

running (0m26.0s), 35/35 VUs, 280 complete and 0 interrupted iterations
order_creation   [  87% ] 30 VUs  26.0s/30s
order_query      [  87% ] 5 VUs   26.0s/30s

running (0m27.0s), 35/35 VUs, 290 complete and 0 interrupted iterations
order_creation   [  90% ] 30 VUs  27.0s/30s
order_query      [  90% ] 5 VUs   27.0s/30s

running (0m28.0s), 35/35 VUs, 300 complete and 0 interrupted iterations
order_creation   [  93% ] 30 VUs  28.0s/30s
order_query      [  93% ] 5 VUs   28.0s/30s

running (0m29.0s), 35/35 VUs, 310 complete and 0 interrupted iterations
order_creation   [  97% ] 30 VUs  29.0s/30s
order_query      [  97% ] 5 VUs   29.0s/30s
time="2026-04-27T08:52:10+09:00" level=warning msg="Request Failed" error="request timeout"
time="2026-04-27T08:52:10+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T08:52:10+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T08:52:10+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
[...]

running (0m30.0s), 35/35 VUs, 324 complete and 0 interrupted iterations
order_creation   [ 100% ] 30 VUs  30.0s/30s
order_query      [ 100% ] 5 VUs   30.0s/30s
time="2026-04-27T08:52:10+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T08:52:10+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T08:52:10+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
[...]

running (0m31.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m32.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m33.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m34.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m35.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m36.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m37.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m38.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m39.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m40.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m41.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m42.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s

running (0m43.0s), 04/35 VUs, 355 complete and 0 interrupted iterations
order_creation ↓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s


  █ THRESHOLDS 

    order_create_duration
    ✗ 'p(95)<3000' p(95)=15s

    order_query_duration
    ✓ 'p(95)<1000' p(95)=21.13ms


  █ TOTAL RESULTS 

    checks_total.......: 718    16.414677/s
    checks_succeeded...: 52.50% 377 out of 718
    checks_failed......: 47.49% 341 out of 718

    ✗ health query: 200
      ↳  0% — ✓ 0 / ✗ 295
    ✓ health query: fast (<500ms)
    ✗ order create: 201 or 503 fast-fail
      ↳  28% — ✓ 18 / ✗ 46
    ✓ order create: not 5xx other

    CUSTOM
    order_create_duration..........: avg=14.86s min=13.88s   med=14.99s   max=15s      p(90)=14.99s  p(95)=15s    
    order_create_errors............: 71.87% 46 out of 64
    order_query_duration...........: avg=13.8ms min=5.54ms   med=7.65ms   max=215.18ms p(90)=14.16ms p(95)=21.13ms

    HTTP
    http_req_duration..............: avg=2.66s  min=5.54ms   med=8.33ms   max=15s      p(90)=14.99s  p(95)=14.99s 
      { expected_response:true }...: avg=14.54s min=13.88s   med=14.81s   max=14.91s   p(90)=14.81s  p(95)=14.83s 
    http_req_failed................: 94.98% 341 out of 359
    http_reqs......................: 359    8.207338/s

    EXECUTION
    iteration_duration.............: avg=3.09s  min=505.87ms med=509.75ms max=15.1s    p(90)=15.1s   p(95)=15.1s  
    iterations.....................: 359    8.207338/s
    vus............................: 4      min=4          max=35
    vus_max........................: 35     min=35         max=35

    NETWORK
    data_received..................: 67 kB  1.5 kB/s
    data_sent......................: 54 kB  1.2 kB/s



running (0m43.7s), 00/35 VUs, 359 complete and 0 interrupted iterations
order_creation ✓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s
time="2026-04-27T08:52:24+09:00" level=error msg="thresholds on metrics 'order_create_duration' have been crossed"